# -*- coding: utf-8 -*-
"""
@Author  : Yc-Ma
@Desc    : TEST JOINER PARSE
@Time    : 2024-11-12 18:12:58
"""
from llmcompiler.graph.joiner import JoinerParser

parser = JoinerParser()


# text = """
#     fund_nav_accumulated_1(code="000751.OF", query_month="36")
#     """

text = """
```json
{
   "_thought_": "我已经找到了所有相关主体的总建筑面积信息，包括北京美廉美连锁商业有限公司、北京物美小马厂商业有限公司和北京玉蜓桥物美科技发展有限公司的相关数据。",
   "_finish_": [
       {
           "指标名称": "总建筑面积（平方米）",
           "主体": "北京美廉美连锁商业有限公司",
           "时点或时段": "2023年",
           "开始时点": "2023-01-01",
           "结束时点": "2023-12-31",
           "单位": "平方米",
           "统计口径": "当期值",
           "指标值": "8,729.74",
           "原文描述": "就德胜门项目，北京美廉美现持有北京市规划和自然资源委员会（简称“北京市规自委”）核发的“京（2023）西不动产权第0015294号”《不动产权证书》，主要信息如下：面积 | 房屋建筑面积8,729.74平方米"
       },
       {
           "指标名称": "总建筑面积（平方米）",
           "主体": "北京物美小马厂商业有限公司",
           "时点或时段": "2023年",
           "开始时点": "2023-01-01",
           "结束时点": "2023-12-31",
           "单位": "平方米",
           "统计口径": "当期值",
           "指标值": "15,280.73",
           "原文描述": "就华天项目，物美小马厂现持有北京市规自委于2023年5月22日核发的“京（2023）海不动产权第0025847号”《不动产权证书》，主要信息如下：面积 | 共有宗地面积10,586.08平方米/房屋建筑物面积15,280.73平方米"
       },
       {
           "指标名称": "总建筑面积（平方米）",
           "主体": "北京玉蜓桥物美科技发展有限公司",
           "时点或时段": "2020年",
           "开始时点": "2020-01-01",
           "结束时点": "2020-12-31",
           "单位": "平方米",
           "统计口径": "当期值",
           "指标值": "29,043.4",
           "原文描述": "就大成项目，玉蜓桥物美现持有北京市规自委于2020年11月9日核发四项《不动产权证书》，主要信息如下：地下一层面积 | 房屋建筑物面积6,980.44平方米，地上一层面积 | 房屋建筑物面积7,027.3平方米，地上二层面积 | 房屋建筑物面积7,415.5平方米，地上三层面积 | 房屋建筑物面积7,620.16平方米"
       }
   ]
}
```
"""

result = parser.parse_text_to_join_outputs(text=text)
print(result.json(ensure_ascii=False))
